<template>
  <div class="main-contents kodawari">
    <h1 class="main-title">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        version="1.1"
        viewBox="0 0 301 148"
        xmlns:xlink="http://www.w3.org/1999/xlink"
        role="img"
      >
        <path
          fill="#eaeaea"
          d="M144.1 87.7c-1.6 0-2.7.6-3.3 1.6a9 9 0 00-.8 3.8 11 11 0 009.1 4.6c1.4 0 2.4-.1 2.9-.4-1.7-6.4-4.4-9.6-7.9-9.6zM164.2 46c-3.5-8-8.2-12-14-12-5.7 0-10.4 4.1-13.8 12.1a47.1 47.1 0 00-4.3 19.5 50 50 0 003.6 20.6c2.3-3.3 5.5-5 9.8-5 5.3 0 10.5 3.6 15.4 10.7a40.3 40.3 0 007.5-26.2 52 52 0 00-4.2-19.7zM150.5 3.5l-70 70 70 70 70-70-70-70zm17.9 113.9c-6.3 0-10.9-4.3-13.7-12.7a28 28 0 01-4.5.3 30.1 30.1 0 01-25.4-11.9 42.7 42.7 0 01-8.5-27.4c0-11.1 2.8-20.1 8.5-27.3a31 31 0 0125.4-11.5c10.8 0 19.3 3.9 25.4 11.5a43 43 0 018.4 27.2c0 7.7-1.3 14.5-3.9 20.3a29 29 0 01-13.9 14.9c2.7 4.2 5.1 6.3 7.5 6.3 1.8 0 4.1-.9 6.8-2.8l2.7 3.3c-3.8 6.5-8.7 9.8-14.8 9.8z"
        />
        <g>
          <title>とんＱの</title>
          <path
            d="M110.9 29.6l-3.1.9c-2.5.6-4.7 1.3-6.4 2.1-3.1 1.3-4.6 2.7-4.6 4.1 0 1.3 1.9 1.9 5.7 1.9.9 0 2.2-.1 4-.4l2.9-.4c.8 0 1.5.4 2.2 1.2.7.8 1 1.7 1 2.4-.1 1.3-2.8 2-8.2 2-2.7 0-5-.4-7-1.2-2.8-1.1-4.1-2.8-4.1-5 0-1.6.7-3 2-4.3.9-.8 2.2-1.7 4.1-2.7a4 4 0 01-.4-1.9l.2-7.1c0-.9-.3-2.1-.8-3.7 0-.5.2-.8.7-.8 1.1 0 2.2.3 3.4 1 1.2.7 1.8 1.3 1.8 1.9 0 .3-.1.7-.4 1.1-.2.3-.3 1.1-.4 2.5l-.1 2.7v2.4l3.3-1.5c.4-.2.7-.4.7-.7v-.4-.4c0-.4.3-.7 1-.7a7 7 0 013.1.9c1.3.7 2 1.5 2 2.3-.3.7-1.1 1.3-2.6 1.8zM152.7 30.7c-.6 3.6-1.6 6.6-3.2 9-1.9 2.8-4.1 4.2-6.7 4.2-3.8 0-5.7-2-5.7-6.1 0-1.6-.3-2.4-.9-2.4-1 0-2.3 1-3.9 3a23.2 23.2 0 00-3.5 5.3c-.4.5-.8.8-1.3.8-.8 0-1.4-.5-2-1.4-.6-.9-.8-1.7-.8-2.5 0-.2.1-.5.5-.9l.7-.8a97.6 97.6 0 0010-18.8l-.1-.7-.1-.7c0-.3.1-.6.4-.9.3-.3.6-.4.9-.4.6 0 1.4.5 2.6 1.4 1.1 1 1.7 1.8 1.7 2.4l-.3.9c-.2.4-.4.6-.6.7-.4.1-1.4 1.7-3.2 4.5l-3.9 6.3c1.7-1.3 3.1-2 4.2-2 1.5 0 2.5.5 3 1.4.3.7.5 1.8.5 3.5 0 .9.1 1.6.4 1.9.3.5.9.7 1.8.7 2.2 0 5.1-3 8.5-9 .4-.7.7-1.1 1-1.1.2 0 .3.2.3.7-.3.4-.3.7-.3 1zM182.3 36.2a10 10 0 01-4.7 5c.9 1.4 1.7 2.1 2.5 2.1.6 0 1.4-.3 2.3-.9l.9 1.1c-1.2 2.2-2.9 3.3-4.9 3.3-2.1 0-3.7-1.4-4.6-4.3l-1.5.1c-3.6 0-6.5-1.3-8.6-4a14.5 14.5 0 01-2.9-9.2c0-3.7.9-6.8 2.9-9.2 2.1-2.6 4.9-3.9 8.6-3.9 3.6 0 6.5 1.3 8.6 3.9 1.9 2.4 2.8 5.4 2.8 9.1-.1 2.7-.5 5-1.4 6.9zM177 22.8c-1.2-2.7-2.8-4-4.7-4-1.9 0-3.5 1.4-4.7 4.1-1 2.2-1.4 4.3-1.4 6.6 0 2.8.4 5.1 1.2 6.9a3.9 3.9 0 013.3-1.7c1.8 0 3.5 1.2 5.2 3.6 1.7-2 2.5-4.9 2.5-8.8-.1-2.4-.5-4.5-1.4-6.7zm-6.8 14c-.6 0-.9.2-1.1.6l-.3 1.3c.8 1 1.8 1.6 3.1 1.6l1-.1c-.6-2.3-1.5-3.4-2.7-3.4zM215.2 39a15.7 15.7 0 01-9.3 3.1c-.6 0-.8-.1-.8-.3l.2-.2c2.3-1 4.3-2.5 6-4.3 2.1-2.3 3.1-4.6 3.1-7 0-4.6-2-6.9-6-6.9.3.6.4 1.3.4 2a25.2 25.2 0 01-5 12c-1.6 2-3 2.9-4.4 2.9-1.4 0-2.5-1-3.3-3.1l-1.2-2.6c-.4-.9-.6-1.8-.6-2.7 0-3.6 1.3-6.4 4-8.7 2.5-2 5.6-3.1 9.2-3.1 3.2 0 5.9 1 7.9 2.8a9.7 9.7 0 013.1 7.6 9 9 0 01-3.3 8.5zM205 23.8a8.9 8.9 0 00-4.8 3A7.7 7.7 0 00198 32c0 .8.1 1.5.4 2.1.3.9.8 1.3 1.5 1.3 1 0 2.2-1.3 3.6-4.1 1.2-2.4 1.8-4.6 1.7-6.7l-.2-.8z"
          />
        </g>
        <g>
          <title>こだわり</title>
          <path
            d="M30.2 53.9c1.9.6 3.9 1.5 5.7 2.3 2 1.1 3.7 2.5 5.3 4.1.1.7-.2 1.2-.7 1.5-1.4.6-2.6.9-3.9 1.1a10 10 0 01-2.8 1.9c-2.3.8-4.5 1.7-6.7 2.8-1 .7-2 1.4-3.1 1.8-4.5 2.1-8 5.3-10.4 9.5l-1.9 4.6c-.8 2.8-.8 5.6 0 8.2 1.5 2.7 3.5 4.7 6 6.2a29.6 29.6 0 0018.6-.4c1.7-.2 3.3-.7 5.1-1.3.3-.1.5-.3.6-.7 2.5 0 4.9.7 7 2.3 1.1.6 2 1.3 2.8 2.3 0 2.3-.7 4.3-2.1 6.1a12 12 0 01-4.9 3.2 19 19 0 01-5.3 1.5l-1.8.4c-1.5.3-2.9.3-4.5.1l.6-.1c-4-.5-7.9-1.1-11.7-1.8A29.5 29.5 0 019.5 102c-2.8-2.8-4-6.1-3.8-10l1.9-4.2c.2-.2.4-.3.6-.2l1.1-3 1.7-2.4.2.3c.6-1.4 1.1-2.9 1.5-4.4l-.2.2c1.6-4 3.9-7.8 6.8-11.2a8.7 8.7 0 00-3.6-.5 9.5 9.5 0 01-7.1-4.5V62c.3.2.6.2 1.1.2l-.4-.7.6.4c-.4-.6-.4-1 0-1.4 4 .4 7.8-.2 11.4-1.9 1.6-.7 3-1.8 4-3.2.3-.4.7-.7 1.2-.9.4-.8 1.1-1.2 1.9-1.1.2-.2.4-.3.8-.2 0 .4.5.6 1 .7zM113.1 59.6c-.8 2-2.4 3.1-4.5 3.4-.5.4-.8.8-1.1 1.3l3.9 2.3a9.6 9.6 0 01-4.8 4.3 11.5 11.5 0 00-4.9 4.6 98.5 98.5 0 00-7.2 16.3l-2.4 12.5c.3 1.1.1 1.9-.7 2.3-.9.6-1.4 1.4-1.3 2.3-.5-.1-.9-.1-1.3.2-.1.2-.2.4-.5.6-.2-.4-.6-.6-1-.7-1.9-2-3.3-4.1-4.5-6.6-.4-.4-.6-.8-.6-1.3l1.3-2.9c3.7-6.6 6.9-13.5 9.6-20.7v-.3a10.3 10.3 0 01-7.3.6 8.7 8.7 0 01-3.6-4.7c.4-.3.7-.9.8-1.5.2.1.5-.2.6-.6 1.5 0 2.8.2 4.1.8 2.2-.3 4.4-1.1 6.3-2.2a7.3 7.3 0 004.1-3l2.7-6.5c-1.9-.6-3.1-1.6-3.6-3.5.7-.1 1.3-.5 1.7-1.1 1.6-.9 3.3-1.5 5.1-1.7l3.1 1.3 2.2 1.1c1.4 1 2.7 2.3 3.8 3.4zm24.2 17.8c.2.9-.2 1.5-1 1.7l-5.5.4-.2.2c-4.7-.5-8.4 1.2-11.3 5.3a58.4 58.4 0 00-7.5 10.4v2.3c3.3 4 7.5 5.2 12.5 3.6l.4-.3.3.1c.3-.6.7-1.1 1.4-1.3v-.1l.6.1.2-.4c3.8.2 7 1.9 9.4 4.7 1.1.9 2 1.9 2.9 2.8a5.3 5.3 0 01-2.3 3 89 89 0 00-3.9 1.3 29 29 0 01-20.7-3.6c-4-2.3-6.5-5.7-7-10.1.4-1.1 1-2 1.6-2.9l.8-1.1c5.5-5.3 10.9-10.9 15.8-16.9.2-.2.2-.5.2-.6a11 11 0 01-4-1.7 6 6 0 00-3.9-1.1c-.2-.1-.5-.2-.7-.5 1.1-1 2.5-1.9 3.9-2.5 3.3-.8 6.6-.7 9.8.2 3.3 2 6 4.3 8.2 7zm-3.6-8.5c-3.2-.6-6.2-1.7-8.8-3.4a3 3 0 01-1.2-2.8c.1-.4.2-.6.6-.6.4.1.6-.1.9-.3a8 8 0 014.5 1.7 31 31 0 013.7 3.5c.4.7.5 1.3.3 1.9zm2.5-11.2c1.2.9 2.2 1.9 2.9 3.2.2.6.2 1.1 0 1.7-.7-.1-1.5-.4-2.1-.8a2 2 0 00-2-.2c-1.4-.4-2.7-.9-3.9-1.6-.7-.4-1.5-.6-2.3-.7-.9-.2-1.6-.6-2.1-1.3a5 5 0 00-.2-1.2c-.2-.4-.2-.7.2-.9l3.2-.6c.9-.2 1.9-.3 2.8-.1a38 38 0 013.5 2.5zM186.2 64.6c.4.4.7.5 1.3.4 1.8.4 3.2 1.2 4.5 2.5a9.4 9.4 0 01-1.9 3.2c-.5 1.1-.8 2-1.1 3.2h.3c4.1-3.3 8.8-5.5 14.2-6.6 2.1-.2 4 0 6.1.7a25.4 25.4 0 0113.1 12.7c.4 2.6.6 5.2.4 7.7.1 4-1.5 6.8-4.8 8.6a12.6 12.6 0 01-7.9 5.4 4 4 0 01-3.2.3c-4.6 2.3-9.5 4-14.4 5.3l-.6-.3 6.7-3.3a23.6 23.6 0 0012.3-16.9 11 11 0 00-3.2-11.6 6.7 6.7 0 00-4.5-1.6l-.2-.2c-8 .2-14.3 3.7-19 10.4a11.2 11.2 0 00-1.2 6.7c.2 2.3.4 4.7.4 7l2 8.2c.2 1.8.1 3.5-.6 5.1-.5 1.2-1.4 2-2.7 2.5a4 4 0 01-3.3-2.3c-1.1-2.2-2.7-4-4.7-5.3-1.5-.5-3.2-.9-4.6-1.2l-1.2-.6c-.5.6-1.1 1-1.6 1.2-1-.4-1.9-1-2.8-1.5-.6-1.5-1.2-3-2.1-4.5-.2-.6.1-1.2.7-1.6.1-.7.4-1.1 1.1-1.4l1.1-.7v-.3l1.2-.5c3.2-1.9 6.1-4.2 8.5-7.1a15 15 0 002.7-9.1h-.3c-2.9 1.9-6 3.2-9.3 4-1.2.2-2.3 0-3.2-.8-.9-.9-1.1-1.9-.7-2.9l.6-.7c.6-.4 1.3-.6 2.2-.3 4.1-2.3 8.3-5.1 12.1-8.2.9-4 1.5-7.9 1.6-12.1l-.5-1.7c.6-.8 1.5-1.4 2.5-1.6 1.5-.2 2.6.4 3.4 1.7 1.1 2.4 1.4 5.2.6 8.1zm-9.3 33.8c-1 .6-1.9 1.4-2.8 2.3v.3l3.3 2.2a39 39 0 00-.5-4.8zM261.9 55.9c1.1 2.3 1.3 4.6.9 7-.4 3.9-1.2 7.7-2.2 11.4h.3l3-3.2a60.8 60.8 0 00-4.5 8.8 19 19 0 002.2 11.9c1.4 1.6 1.5 3.2.4 4.5.1.7-.2 1.1-.9 1a.7.7 0 01-.6-.4c-1 .2-1.9 0-2.6-.4l-3.6-1.7a5.3 5.3 0 01-1.7-1.9c-1.1-1.7-2.1-3.4-3.3-5 .1-1.5.6-2.9 1.3-4.3 1-6.7 3-13.1 6.1-19.4l2.7-8.6.6-.3c.1-.1.2 0 .3.2.5-.6.9-.4 1.6.4zm23.7-2.8c2.3 1.1 4.1 2.6 5.7 4.5.6 2.5.9 5.1.6 7.7.7 7.8 1.1 15.6 1.1 23.3-.6 4.5-2.3 8.6-5.2 12.2-3.6 2.1-7.1 4.2-10.5 6.5a34.8 34.8 0 01-10.8 4.7c-2.9.7-5.8 1.6-8.5 2.8-.5.1-1 .2-1.5.5 3.2-2 6.2-4 9.1-6.2l2.7-2.4 4.9-5.4a33.8 33.8 0 006.6-20.3l-.4-22.9a.2.2 0 01-.2-.2 19 19 0 01-5 1.9c-.8.3-1.5.7-2.2 1.2-.1-.6.1-1.2.5-1.7l4.3-5.1c1.1-.2 2.1-.7 3.1-1.4l1.7-.2c.6-.2 1.1-.2 1.8 0 .6.2 1.3.4 2.2.5z"
          />
        </g>
        <g>
          <title>Quest for Quality</title>
          <path
            d="M87.2 142.6l-1.5.4-1.7.1c-2.4 0-4.4-.7-5.8-2a7 7 0 01-2.1-5.4c0-2.2.8-4.1 2.3-5.5a8.4 8.4 0 016-2.1c2.4 0 4.4.7 5.8 2a6.9 6.9 0 012.2 5.4c0 1.5-.3 2.7-1 3.8-.6 1.1-1.6 2-2.8 2.6.9.8 1.8 1.4 2.8 1.8l1.4.9v.2h-.1c-.5 0-1.3-.2-2.3-.7s-2.2-.8-3.2-1.5zm.6-1.4c.9-.6 1.5-1.4 1.9-2.3.4-.9.7-2 .7-3.2 0-2-.6-3.6-1.7-4.9s-2.6-1.9-4.4-1.9c-1.8 0-3.3.6-4.4 1.8a6.3 6.3 0 00-1.7 4.7c0 2 .6 3.6 1.8 4.9a5.8 5.8 0 004.5 1.9l.9-.1 1-.2-1.2-1.1-.3-.4.5-.4.6-.4.7.6 1.1 1zM100.8 141.6l-1.7.9-1.5.6c-.9 0-1.6-.3-2.1-.9-.4-.6-.6-1.5-.6-2.9v-1.6-1.7-.4-.4l.3-.2.5-.2.9-.3.5-.2.2.1.1.2-.2.3-.3.4c-.2.3-.3.6-.3 1.1l-.1 2c0 1.2.2 2.1.5 2.6s.8.7 1.5.7l1-.2 1.4-.5v-4.3c0-.8-.2-1.2-.5-1.4l-.1-.1.2-.4h.1l.9-.4.6-.2.3.2.2.3v.1l-.2 1.2-.1 1.8v2.4l.1 2v.2l-.7.6-.8.4-.1-.1v-.6-.5-.6zM106.3 139.1c.1.8.4 1.5.8 1.9.4.4 1.1.7 1.8.7.6 0 1.1-.1 1.5-.3l1.2-.9.2-.3.3-.3.2.1.1.2-.4.8-1 1.4-.9.6-1.5.1c-1.3 0-2.3-.3-3-1-.7-.7-1-1.7-1-2.9 0-1.3.4-2.5 1.2-3.4s1.7-1.4 2.8-1.4c.7 0 1.3.2 1.8.6.5.4.7.9.7 1.6 0 .4-.4.8-1.3 1.3-.7.4-1.9.8-3.5 1.2zm0-.7c.9-.1 1.7-.3 2.2-.7.6-.4.8-.9.8-1.4 0-.3-.1-.6-.3-.8-.2-.2-.5-.3-.8-.3-.6 0-1 .3-1.4.8s-.6 1.2-.6 1.9v.2l.1.3zM116.2 143l-1.5-.1-1.1-.2a.2.2 0 01-.2-.2l-.1-.7v-.3l.1-.9c0-.1.1-.2.3-.2l.2.1.1.2v.1c0 .5.2.9.5 1.1.3.2.8.4 1.4.4.9 0 1.6-.2 2.2-.6.6-.4.9-.9.9-1.4 0-.3-.1-.5-.3-.6l-.9-.2h-1c-.9 0-1.6-.2-2-.5s-.6-.8-.6-1.5c0-.9.3-1.6 1-2.2.6-.6 1.4-.9 2.4-.9l1.4.2.6.3-.1.6-.3.3-.3-.1c-.6-.3-1.3-.4-1.9-.4-.5 0-.9.1-1.2.4-.3.2-.5.6-.5 1s.1.7.4.8c.3.2.9.3 1.9.4 1.2.1 2 .3 2.4.6s.6.8.6 1.5c0 .9-.4 1.7-1.2 2.2-.8.6-1.9.8-3.2.8zM123.1 142.1v-1.7-1.9-1.3-1.5h-.8v-.2l.2-.3.1-.1 2.3-2 .2-.2h.1l.1.1.1.1-.1.2c-.2.5-.4 1-.4 1.4h2.9l.2.1.1.3-.1.4-.4.1h-2.8l-.1 1.7v1.5c0 1.2.2 2 .5 2.5s.8.8 1.6.8l1.2-.2.7-.2h.1v.2c0 .3-.3.5-1 .8a5 5 0 01-2 .4c-.5 0-1-.1-1.4-.3s-1-.4-1.3-.7zM136.9 135.6l-.1 3.1-.3 7.4c0 .2-.1.3-.4.5l-.6.2-.3-2.1-.1-8.6-.1-.4-.4-.1h-.7l-.1-.2v-.4l.1-.2.2-.1H135v-.3-.3c0-1.7.3-3.1 1-4a3 3 0 012.7-1.4l.7.1c.1 0 .2.1.2.3l-.1.8c0 .1-.1.2-.3.2l-.7-.2-.9-.2c-.6 0-.9 1.2-.9 3.7v1.2h2.5l.4.1.1.4-.1.4-.5.1h-2.2zM145 134.3a4 4 0 012.9 1.1c.7.8 1.1 1.8 1.1 3.1a4 4 0 01-1.3 3.2 4 4 0 01-3.2 1.3c-1.2 0-2.1-.4-2.8-1.1-.7-.7-1-1.7-1-3 0-1.4.4-2.5 1.2-3.4s1.8-1.2 3.1-1.2zm-.6 1c-.7 0-1.3.2-1.7.7-.4.5-.6 1.2-.6 2.2 0 1.1.3 2 .9 2.7.6.7 1.3 1.1 2.1 1.1.7 0 1.3-.2 1.7-.7.4-.5.6-1.1.6-1.9 0-1.2-.3-2.2-.9-2.9a2.4 2.4 0 00-2.1-1.2zM153.1 136.2c.4-.6.9-1 1.4-1.4.5-.3.9-.5 1.3-.5h.1v1.3c0 .3-.2.4-.5.4h-.6c-.7.1-1.1.2-1.3.4s-.4.8-.4 1.7l-.1 2.6-.1 1.5-.7.4-.7.3h-.1v-.1-.2l.1-3.7v-1l-.1-1.8c-.1-.2-.2-.4-.5-.4l-.7.2a1 1 0 00-.4.2l-.1-.1-.1-.2.5-.4.5-.2 1.4-.6.7-.4h.2l.1.1v1.4l.1.5zM173.3 142.6l-1.5.4-1.7.1c-2.4 0-4.4-.7-5.8-2a7 7 0 01-2.1-5.4c0-2.2.8-4.1 2.3-5.5a8.4 8.4 0 016-2.1c2.4 0 4.4.7 5.8 2a6.9 6.9 0 012.2 5.4c0 1.5-.3 2.7-1 3.8-.6 1.1-1.6 2-2.8 2.6.9.8 1.8 1.4 2.8 1.8l1.4.9v.2h-.1c-.5 0-1.3-.2-2.3-.7s-2.2-.8-3.2-1.5zm.5-1.4c.9-.6 1.5-1.4 1.9-2.3.4-.9.7-2 .7-3.2 0-2-.6-3.6-1.7-4.9s-2.6-1.9-4.4-1.9c-1.8 0-3.3.6-4.4 1.8a6.3 6.3 0 00-1.7 4.7c0 2 .6 3.6 1.8 4.9a5.8 5.8 0 004.5 1.9l.9-.1 1-.2-1.2-1.1-.3-.4.5-.4.6-.4.7.6 1.1 1zM186.8 141.6l-1.7.9-1.5.6c-.9 0-1.6-.3-2.1-.9-.4-.6-.6-1.5-.6-2.9v-1.6-1.7-.4-.4l.3-.2.5-.2.9-.3.5-.2.2.1.1.2-.2.3-.3.4c-.2.3-.3.6-.3 1.1l-.1 2c0 1.2.2 2.1.5 2.6s.8.7 1.5.7l1-.2 1.4-.5v-4.3c0-.8-.2-1.2-.5-1.4l-.1-.1.2-.4h.1l.9-.4.6-.2.3.2.2.3v.1l-.2 1.2-.1 1.8v2.4l.1 2v.2l-.7.6-.8.4-.1-.1v-.6-.5-.6zM196 141.3c-.5.5-1.1.9-1.7 1.2a4 4 0 01-1.9.4c-.6 0-1-.1-1.3-.4s-.5-.6-.5-1.1c0-.9.5-1.6 1.5-2.2s2.3-1.1 4.1-1.4v-.2c0-.7-.1-1.2-.4-1.6-.3-.3-.7-.5-1.3-.5l-1.1.2-.6.2h-.1v-.1c0-.5.2-.9.6-1.1a5 5 0 012-.3c.9 0 1.5.2 1.9.6.4.4.5 1.2.5 2.3V139.9l.2 1.4c.2.3.4.6.8.8l.6.1c.2 0 .4.1.4.3 0 .1-.2.3-.6.4l-1.2.2c-.5 0-.9-.1-1.2-.4-.4-.4-.6-.8-.7-1.4zm.2-2.9c-1.2.2-2.1.5-2.8 1-.7.4-1 1-1 1.5 0 .3.1.6.3.8s.5.3.9.3c.8 0 1.4-.3 1.9-.9s.7-1.4.7-2.3v-.2-.2zM201.7 139.2v-5.3-1.1-.8l-.1-2.6v-.2c0-.2.1-.3.4-.3l.4-.1 1.2-.3.6-.2.2.1.1.2s-.1.2-.4.3c-.3.2-.4.4-.5.6l-.2 2.2-.1 6.7v1.1l.1 1.7c.1.2.2.4.4.4l.6-.1.3-.1.2.1.1.2c0 .1-.2.3-.6.4l-.7.2-1.2.6-.6.4-.2-.1-.1-.2v-.1c-.1-.7.1-2 .1-3.7zM209 137.6v4.7l-.1.2-.2.1-.7.2a1 1 0 00-.4.1l-.1-.2V137l-.2-1.4c-.1-.2-.3-.3-.6-.3l-.3.1-.2.1-.2-.1-.1-.3.6-.3.7-.2 1-.4.6-.2.2.1.1.2v.2l-.1 3.1zm-1-8.5c.3 0 .6.1.8.3s.3.5.3.8c0 .3-.1.5-.3.8-.2.2-.5.3-.8.3-.3 0-.5-.1-.7-.3s-.3-.5-.3-.7c0-.3.1-.6.3-.8s.4-.4.7-.4zM212.5 142.1v-1.7-1.9-1.3-1.5h-.7v-.2l.2-.3.1-.1 2.3-2 .2-.2h.1l.1.1.1.1-.1.2c-.2.5-.4 1-.4 1.4h2.9l.2.1.1.3-.1.4-.4.1h-2.8l-.1 1.7v1.5c0 1.2.2 2 .5 2.5s.8.8 1.6.8l1.2-.2.7-.2h.1c.1 0 0 .1 0 .1v.1c0 .3-.3.5-1 .8s-1.4.4-2 .4c-.5 0-1-.1-1.4-.3-.8-.2-1.1-.4-1.4-.7zM222.3 141.3l-2.2-4.6-.5-.8a.8.8 0 00-.5-.2l-.5.1-.3.1-.2-.1-.1-.2c0-.1.1-.2.4-.3l.5-.2 1.2-.5.6-.3c.1 0 .2.1.3.4l.1.3 2.6 5.7 3.4-5.8.3-.6c.1-.3.3-.4.4-.4l.2.1.1.4v.8c0 .4-.1.8-.3 1.1l-.2.2-6.2 9.7-.3.3-.5.1h-.1v-.1-.2l.2-.3 1.7-2.8v-.1c.3-.4.4-.7.4-.9l-.3-1-.2.1z"
          />
        </g>
      </svg>
    </h1>
    <section class="kodawari_section yamatobuta">
      <div class="section_inner">
        <div class="inner_wrap right">
          <h2 class="section_title title">
            とんＱといったらコレ！<br />
            国産ブランドやまと豚
          </h2>
          <p class="section_text">
            やまと豚は、国内の指定牧場で種豚の生産から育種、餌・環境など全て徹底した管理で育てた銘柄豚。
            きめ細かで柔らかな肉質と上品な香りのするほの甘い脂の旨みを、是非一度ご賞味下さい。
          </p>
          <div class="kodawalist">
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-pork01.webp"
                  alt="やまと豚こだわり１"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">やまと豚の育て方</h3>
                <p class="caption_text">
                  品種改良によりすぐれた肉質と病気に強い体質が実現したやまと豚。豚の肉質や健康面を意識した天然ミネラルを含む独自の飼料与えられ、
                  ストレスのない快適な環境でのびのび健康に育ちます。
                </p>
              </figcaption>
            </figure>
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-pork02.webp"
                  alt="やまと豚こだわり２"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">ITIで「三ツ星」獲得！</h3>
                <p class="caption_text">
                  「食品のミシュランガイド」と言われているITI(国際味覚審査機構の審査会)。「やまと豚」は、優秀味覚賞「三ツ星」を7年連続で受賞。2021年に国産豚肉として日本初の「ダイヤモンド味覚賞」に輝きました。
                </p>
              </figcaption>
            </figure>
          </div>
        </div>
      </div>
    </section>
    <section class="kodawari_section rice">
      <div class="section_inner">
        <div class="inner_wrap left">
          <h2 class="section_title title">
            香りまで美味しい<br />
            ほっかほか炊きたてご飯
          </h2>
          <p class="section_text">
            お替り自由、いつでも炊き立てのホカホカご飯は常時2種類。白いご飯と、五穀米・麦飯・季節の炊き込みご飯など、種類は店舗や時期によって異なります。お好みに合わせてお好きな方をお選び下さい。※時間帯によっては、提供していない場合もございます。
          </p>
          <div class="kodawalist">
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-rice01.webp"
                  alt="ご飯こだわり１"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">その時期一番美味しいお米</h3>
                <p class="caption_text">
                  安心・安全と美味しさのために、とんQで使用するお米は信頼ある米のプロが、その時期一番美味しい地域から取り寄せたお米。
                  水はけの良い豊かな土壌と、輝く太陽の元で真心こめて育てられたお米は、一粒一粒がしっかりしていて粘りも甘みも抜群です。
                </p>
              </figcaption>
            </figure>
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic_2_rice.jpg"
                  alt="ご飯こだわり２"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">竈～赤子泣いても蓋取るな～</h3>
                <p class="caption_text">
                  春日部・ふじみ野・水戸千波・イイアスつくばの４店舗では、昔懐かしのかまどを再現。こだわりの銘柄米に、炭を入れ、体に良い非イオン化活性水、πウォーターなどで炊き上げたご飯はふっくらホックホク。お米本来の味と香りが生きています。
                </p>
              </figcaption>
            </figure>
          </div>
        </div>
      </div>
    </section>
    <section class="kodawari_section vegetable">
      <div class="section_inner">
        <div class="inner_wrap right">
          <h2 class="section_title title">
            栄養満点、味一番。<br />
            旬の野菜で季節満喫
          </h2>
          <p class="section_text">
            「旬」それは、最高の「美味しい！」を目指すとんＱが大切にしているものの一つ。
            全国各地から選りすぐった、その季節で最も美味しく栄養豊富な旬の素材を、是非じっくりとご堪能下さい。
          </p>
          <div class="kodawalist">
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-vege02.webp"
                  alt="野菜こだわり１"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">
                  キャベツ・手作りドレッシング
                </h3>
                <p class="caption_text">
                  シャキシャキのキャベツは全国の産地から、その時期一番美味しい産地のものを選択。ドレッシングは常時２種類でにんじん・和風・梅・ごまなど全て手づくり。キャベツの甘みを引き立てます。
                </p>
              </figcaption>
            </figure>
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-vege01.webp"
                  alt="野菜こだわり２"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">自慢のとん汁・季節の味噌汁</h3>
                <p class="caption_text">
                  味噌汁は、常時２種類。とんＱ自慢のとん汁と、旬の素材を使った季節の味噌汁からお選び下さい。味噌汁の具は店舗ごと、季節とともに変化し、それに合わせて味噌の種類も変化。お膳から季節を感じて頂けるよう、心をこめて毎日お作りしています。
                </p>
              </figcaption>
            </figure>
          </div>
        </div>
      </div>
    </section>
    <section class="kodawari_section omotenashi">
      <div class="section_inner">
        <div class="inner_wrap left">
          <h2 class="section_title title">
            心からの笑顔で<br />
            心からお客様のために
          </h2>
          <p class="section_text">
            私たちは、大切なお客様を我が家に招き、自慢の美味しい料理を召し上がって頂く心で調理し、
            接客し、精いっぱいのこだわりと心からのおもてなしでお迎えしたいと思います。（とんＱスタッフ一同）
          </p>
          <div class="kodawalist">
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-service01.webp"
                  alt="おもてなしこだわり１"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">調理は技術、そして心…</h3>
                <p class="caption_text">
                  とんＱの料理を語る上で欠かせないもの、それは他では真似の出来ない独自の高い調理技術と、それを生み出す「人」。最高の食材、最高の技術、人が一体となって、とんＱの最高の料理が生まれます。品質に一切妥協はありません。
                </p>
              </figcaption>
            </figure>
            <figure class="kodawari_figure">
              <div class="figure_photo">
                <img
                  src="~assets/image/kodawari/pic-service02.webp"
                  alt="おもてなしこだわり２"
                  loading="lazy"
                />
              </div>
              <figcaption class="caption">
                <h3 class="caption_title title">マニュアルのない接客</h3>
                <p class="caption_text">
                  とんＱには、一般のお店のような、「接客マニュアル」が存在しません。
                  あるとすれば、「心からのおもてなし」。それが私たちの基準です。いつでも、どんなときでも。とんＱスタッフは心いっぱいの笑顔でお待ちしております。
                </p>
              </figcaption>
            </figure>
          </div>
        </div>
      </div>
    </section>
  </div>
</template>

<style lang="scss" scoped>
.kodawari {
  padding: 50px 0 0 0;
  .main-title {
    width: 90%;
    margin: 0px auto 50px auto;
    max-width: 500px;
    @media screen and (max-width: 900px) {
      max-width: 400px;
    }
    @media screen and (max-width: 600px) {
      max-width: 300px;
    }
  }
}

.kodawari_section {
  height: 100%;
  background-size: cover;
  position: relative;
  @media screen and (max-width: 699px) {
    background-size: contain;
    background-repeat: no-repeat;
    padding-top: 70%;
  }
  &.yamatobuta {
    background-position: top left;
    background-image: url(~assets/image/kodawari/bg_image01.jpg);
    @media screen and (max-width: 699px) {
      background-image: url(~assets/image/kodawari/bg_image01_s.jpg);
      margin: 0;
    }
  }
  &.rice {
    background-position: top right;
    background-image: url(~assets/image/kodawari/bg_image02.jpg);
    @media screen and (max-width: 699px) {
      background-image: url(~assets/image/kodawari/bg_image02_s.jpg);
      margin: 20px 0 0 0;
    }
  }
  &.vegetable {
    background-position: top left;
    background-image: url(~assets/image/kodawari/bg_image03.jpg);
    @media screen and (max-width: 699px) {
      background-image: url(~assets/image/kodawari/bg_image03_s.jpg);
      margin: 20px 0 0 0;
    }
  }
  &.omotenashi {
    background-position: top right;
    background-image: url(~assets/image/kodawari/bg_image04.jpg);
    @media screen and (max-width: 699px) {
      background-image: url(~assets/image/kodawari/bg_image04_s.jpg);
      margin: 20px 0 0 0;
    }
  }
  &::after {
    content: "";
    width: 100%;
    height: 100%;
    position: absolute;
    z-index: 1;
    top: 0;
    left: 0;
    background-image: radial-gradient(
        rgba(255, 255, 255, 0.3) 20%,
        transparent 20%
      ),
      radial-gradient(rgba(255, 255, 255, 0.3) 20%, transparent 20%);
    background-size: 10px 10px;
    background-position: 0 0, 5px 5px;
  }
  .section_inner {
    position: relative;
    z-index: 2;
    width: 95%;
    max-width: 1300px;
    height: 100%;
    position: relative;
    margin: 0 auto;
    .inner_wrap {
      width: 60%;
      height: 100%;
      padding: 50px 0 13% 0;
      @media screen and (max-width: 1300px) {
        padding: 50px 0 80px 0;
      }
      &.right {
        margin: 0 0 0 auto;
        background: linear-gradient(
          to left,
          rgba(255, 255, 255, 1) 0%,
          rgba(255, 255, 255, 1) 10%,
          rgba(255, 255, 255, 0) 100%
        );
        @media screen and (max-width: 699px) {
          margin: 0 auto;
          background: none;
          width: 90%;
        }
      }
      &.left {
        margin: 0 auto 0 0;
        background: linear-gradient(
          to right,
          rgba(255, 255, 255, 1) 0%,
          rgba(255, 255, 255, 1) 10%,
          rgba(255, 255, 255, 0) 100%
        );
        @media screen and (max-width: 699px) {
          margin: 0 auto;
          background: none;
          width: 90%;
        }
      }
      .section_title {
        font-size: 2em;
        margin: 30px 0 20px 0;
        line-height: 1.2em;
        filter: drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff)
          drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff);
        font-family: "Hiragino Sans";
        font-weight: bold;
        border-left: 15px solid;
        padding-left: 0.5em;
        @media screen and (max-width: 699px) {
          text-align: center;
          margin: 0;
          font-size: 1.6em;
          border-left: none;
        }
      }
      .section_text {
        margin: 0 auto;
        font-size: 1.15em;
        line-height: 1.7em;
        padding: 10px 0 20px 0;
        filter: drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff)
          drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff);
        @media screen and (max-width: 699px) {
          margin: 10px auto;
          width: 90%;
        }
      }
    }
  }
}
.yamatobuta .title {
  color: #750809;
}
.rice .title {
  color: #511b7e;
}
.vegetable .title {
  color: #42591a;
}
.omotenashi .title {
  color: #8b5114;
}

.kodawalist {
  list-style: none;
  margin: 0;
  padding: 0;
  text-align: center;
  display: flex;
  justify-content: space-around;
  letter-spacing: -0.4em;
  @media screen and (max-width: 699px) {
    text-align: left;
    display: block;
    letter-spacing: 0;
  }
  .kodawari_figure {
    margin: 0 1.2%;
    padding: 0;
    width: 46%;
    vertical-align: top;
    letter-spacing: normal;
    @media screen and (max-width: 699px) {
      width: 90%;
      max-width: 500px;
      margin: 0 auto 30px auto;
    }
    .figure_photo {
      border: 5px solid #fff;
      filter: drop-shadow(0 1px 4px rgba(110, 110, 110, 0.553));
      text-align: center;
      @media screen and (max-width: 699px) {
        max-width: 400px;
        margin: 0 auto;
      }
      img {
        width: 100%;
      }
    }
    .caption {
      margin: 0;
      padding: 0;
      @media screen and (max-width: 699px) {
        max-width: 400px;
        margin: 0 auto;
      }
      &_title {
        margin: 0.8em 0 0.6em 0;
        padding: 0;
        text-align: left;
        font-weight: bold;
        font-size: 1.1em;
        font-family: "Hiragino Sans";
        filter: drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff)
          drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff);
      }
      &_text {
        margin: 0;
        padding: 0;
        text-align: left;
        font-size: 0.9em;
        line-height: 1.7em;
        filter: drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff)
          drop-shadow(0 0 10px #fff) drop-shadow(0 0 10px #fff);
        @media screen and (max-width: 699px) {
          font-size: 0.85em;
        }
      }
    }
  }
}
</style>
